[
  {
    "nameversion": "v1.1.2",
    "date": "10-Sep-2025",
    "resume": "Lanzamiento inicial de la plataforma",
    "changes": [
      "Se agregaron formularios para solicitar altas de docentes y materias",
      "Se agregaron los filtros para buscar docentes por materia y departamento",
      "Se incorporó la función de predicción de desempeño docente"
    ],
    "description": "Esta versión es la primera versión desplegada de la plataforma, que incluye formularios para solicitar altas de docentes y materias, filtros para buscar docentes por materia y departamento, y una función de predicción de desempeño docente basada en evaluaciones anteriores."
  },
  {
    "nameversion": "v1.1.3",
    "date": "17-Sep-2025",
    "resume": "Correcciones menores y adición de datos faltantes",
    "changes": [
      "Se corrigieron los formularios de solicitud de alta de materias",
      "Se corrigieron los formularios de solicitud de alta de docentes",
      "Se incorporaron docentes y materias faltantes"
    ],
    "description": "Esta versión es la primera versión estable de la aplicación, con correcciones menores en los formularios de solicitud de altas y la incorporación de docentes y materias que faltaban en la base de datos."
  },
  {
    "nameversion": "v1.2.0",
    "date": "17-Oct-2025",
    "resume": "Nueva sección de evaluación de departamentos y mejoras varias",
    "changes": [
      "Se agregó una nueva sección para la evaluación de departamentos.",
      "Incorporación de docentes y materias faltantes.",
      "Se agregó un menú de inicio.",
      "Se incorporó el sistema de eventos mensuales.",
      "Se agregó el minijuego especial Halloween, disponible del 30 de octubre al 02 de noviembre.",
      "Se actuaizó el UI del apartado evaluación docente.",
      "Se agregó un apartado de reportes para incidentes."
    ],
    "description": "Esta versión introduce una nueva sección para la evaluación de departamentos, además de incorporar docentes y materias que faltaban. También se añadió un menú de inicio para mejorar la navegación, un sistema de eventos mensuales para mantener la plataforma dinámica, un apartado de reportes para incidentes, y un minijuego especial de Halloween disponible por tiempo limitado."
  },
  {
    "nameversion": "v1.3.0",
    "date": "19-Oct-2025",
    "resume": "Nueva sistema de reportes de publicaciones e incidentes",
    "changes": [
      "Se agregó el aviso de privacidad en el menu y en el footer.",
      "Se agregó el sistema de reportes en opiniones de departamentos y docentes.",
      "Se incorporó el apartado para administradores para atender reportes."
    ],
    "description": "Esta versión introduce un nuevo sistema de reportes para publicaciones e incidentes, permitiendo a los usuarios reportar contenido inapropiado o problemas técnicos. Además, se añadió el aviso de privacidad en el menú y en el footer para cumplir con las regulaciones de protección de datos."
  },
  {
    "nameversion": "v1.3.1",
    "date": "21-Oct-2025",
    "resume": "Validación de carga de archivo en el sistema de reportes",
    "changes": [
      "Se implementaron las validaciones de carga de archivos en el sistema de reportes."
      
    ],
    "description": "Esta versión se centra en corregir errores en el sistema de reportes introducido en la versión anterior, asegurando que los usuarios puedan enviar reportes sin problemas."
  }
]